# set和dict类似，也是一组key的集合，但不存储value。由于key不能重复，所以，在set中，没有重复的key。
print("*********************************")
s = set([1, 2, 3])
print(s)

# 重复元素自动过滤
print("*********************************")
s = set([1, 1, 2, 2, 3, 3])
print(s)

# 添加元素
print("*********************************")
s.add(4)
s.add(4)
s.add(4)
print(s)

# 删除元素
print("*********************************")
s.remove(4)
print(s)

# 遍历
print("*********************************")
for e in s:
    print(e)

# set可以看成数学意义上的无序和无重复元素的集合,因此，两个set可以做数学意义上的交集、并集等操作
print("*********************************")
s1 = set([1, 2, 3])
s2 = set([2, 3, 4])
print(s1 - s2)  # 差
print(s1 & s2)  # 交
print(s1 | s2)  # 并
